"""Создать класс Rectangle:
-конструктор принимает две стороны x,y
-описать арифметические методы:
  + сума площадей двух экземпляров класса
  - разница площадей
  == или площади равны
  != не равны
  >, < меньше или больше
  при вызове метода len() подсчитывать сумму сторон

  ###############################################################################
1) написати програму для запису відомостей про пасажирські перевезення
2) перевезення відбувається трьома способами, літаком, машиною, поїздом,
3) дані які треба буде зберігати:
  - вартість квитка(літак, поїзд)
  - кількість пасажирів(машина)
  - час в дорозі(всі)
  - час реєстрації(літак)
  - клас:перший,другий(літак)
  - вартість пального(машина)
  - км(машина)
  - місце: купе,св(поїзд)
4) методи:
  - розрахунок вартості доїзду(машина)
  - загальний час перельоту(літак)
  - порівняти час в дорозі між двома будь якими транспортними засобами(двома об'єктами) - наприклад"літак на 5 годин швидше за поїзд"
  - вивести всі дані про перевезення(поїзд)

  ######################################################################

1)Створити пустий list
2)Створити клас Letter
3) створити змінну класу __count.
4) при створенні об'єкта має створюватись змінна об'єкта(пропертя) __text, для цієї змінної мають бути гетер і сетер
5) при створені об'єкта __count має збільшуватися на 1
6) має бути метод(метод класу) для виводу __сount
7) має бути метод який записує в наш ліст текст з нашої змінної __text"""